content-org/santiyounger-website.org
#+HUGO_BASE_DIR:~/hugo/santiyounger-website
#+hugo_weight: auto
* "Davincism" A Modern Philosophy For People With Various Interest :Davincism:
  :PROPERTIES: 
  :EXPORT_HUGO_SECTION: posts
  :EXPORT_FILE_NAME: davincism
  :EXPORT_DATE: 2020-08-05
  :CUSTOM_ID: Davinci-200803
  :END: 
** A New Modern Philosophy I've been playing with an idea a while.
   *What if I started a movement for a modern school of thought?* It would be a philosophy for creators. I would name this philosophy Davincism in honor to the greatest creator of all time Leonardo DaVinci. 

** What Is Davincism And Who Is It For?
   Davincism would become a modern philosophy for creators who unlike the very well established counterparts "specialists" can't or don't want to focus on just one interest. 

   *It is a philosophy with the aim to bring together all types of creative people* who want to learn how to be their true self. Davincism promotes the idea to combine most or all of your interests into your creative output. 

** Who Is This Philosophy Not For?
   Even thought they can still learn from *Davincism this philosophy is not made for specialist.* Davincism doesn't treat specialists as the enemies. This philosophy aims to fix what for centuries has been a world that only praises those who can "focus" and specialize on just one field. 

** The Multi-Niche Method
   This modern philosophy is very much aimed for you, if you want to create content online. If your goal is to: - Work For Yourself - Start A Business - Create A Personal Brand Then this creative philosophy is for you. The multi-niche method is a rebellion against the common /"you need to niche down"/ advice that we all hear everywhere.
   *There's no denying on the monetary advantages of a niche,* specialization is a great approach to creative work, but it's not the only way.

   The multi-niche method teaches how to make it as someone with various interests, and use that creative power to your advantage, this could take the form of combining various niches or of finding a way to innovate on all of them simultaneously. This is a concept I'm still expanding on, if you'd like to learn more feel free to contact me. 
 
   # add contact 
 
** What Term Is Used To Describe A Follower Of Davincism? 
   Someone who practices the concepts of Davincism would be called a /Davincist./ You can start calling yourself a Davincist from the moment you choose to, this is not a religious movement, nor a private club. My hope is to make Davincism a established idea that anyone who doesn't want to follow in specialization can adopt.

** A Short Note On Our Hero Leonardo
   As we all know DaVinci is one of the most brilliant geniuses that humanity has sees. There might be thousands of people like him right now, who’s goals and ambitions have never been able to reached Leonardo’s level of achievements and admiration.

   Perhaps you (just like me) have also been *envious of Leonardo’s ability to line up all of his talents* and pass to history as the most successful Polymath. DaVinci had an incredible ability to work on an infinite amount of different fields of study, including: 

   - Art 
   - Science 
   - Architecture 
   - Anatomy 
   - Engineering 
   - Philosophy


   The list goes on, almost to the extent where you could mention any field of study and research on how DaVinci made some mayor contributions to it.
 
** The Times When People Like DaVinci Were Admired 
   Leonardo didn't have an easy life, but he was born in a time where being a generalist was admired. The Renaissance man, was someone who has many talents, someone who had the ability to aquiere a higher knowledge in many fields of study.

** The Rise Of Specialization The Downfall Of Generalists 
   Unlike today, being a single talented specialist wasn't very admirable. *We lost our way with the rise of industrialization* where we created a market that treats us as productivity machines more than actual humans, filled with curiosity and a desire to learn.

** Nature Vs Nurture
   It's hard to tell if some of us are born to have several interests, or if it's a personality trait we acquire. Some say we are all born with infinite curiosity and society pushes us down the funnel of specialization, (this is not too hard to believe) weather you think you were born like this, or if it's a choice, let me encourage you to be who you want to be to the fullest. 

** Many Terms To Describe Someone Like DaVinci
   Davincism is a term that aim to unify all the different ways in which people like as are referred to. Just to mention a few:

   - Jack of All Trades
   - Generalist
   - Polymath
   - Multipotentialite
   - Scanner

** Why A New Term?
   Unfortunately, some of the terms used to describe have the intention to look down on us. Jack of All Trades is something used to describe someone unfocused, Generalist is someone who can't specialize. 

   Polymath is an amazing term, yet not well know and difficult to understand just by reading it. Davincism is a term that can be understood from just reading it. 

   Most people know who Leonardo DaVinci is, he is recognized as a genius and it's an empowering term for those of use who want to be more like DaVinci and become the true versions of ourselves with all of our interests and passions.

** What's Next 
   Considering that you are on board with this new philosophy, *you can become a practicing Davincist from this moment onward.* Of course using a new term won't chance your life just like that, but it's a start. y thoughts on this new philosophy are in progress. If you would like to find out more how to be a successful Davincist I'd love to help, feel free to contact me, let's create a movement together.
**  COMMENT 
**** Blog Post properties  
     first draft written in <2020-07-31 Fri>
**** blog post Todo
***** links add links for the Multi Hyphened Method add links for Refuse To Choose
**** Index Card Notes Used # [[file:20200718095121-polymath.org][polymath]] # [[file:24,0-multipotentialite.org][multipotentialite]] # [[file:24,1-multipotentialite_Davinci.org][multipotentialite example DaVinci]] Consulting call
